# NoProfileForRail Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..NoProfileForRail Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Must specify Profiles for every Rail.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoProfileForRail { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoProfileForRail As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoProfileForRail {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace